# FtSup4 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..FtSup4 Property
SymbolTypeId Class See Also
---
Symbol ft⁴, indicating unit Feet to the fourth power.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId FtSup4 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FtSup4 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FtSup4 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace